app/controllers/projects/tasks_controller.rb

INSERT INTO "tasks" ("title", "description", "project_id", "created_at", "updated_at", "completed", "task_file") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @task = Task.new(task_params)
    @task.project_id = @project.id
    puts "*******************"
    puts task_params
    puts "*******************"
    puts @project.id
    puts "*******************"

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "Create Login Component Update xMM"], ["updated_at", "2024-09-16 04:38:06.117410"], ["id", 1]]
---
  def update
    puts "******************* update"
    puts task_params
    puts "******************* update"
    respond_to do |format|
      if @task.update(task_params)