app/controllers/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT "projects".* FROM "projects" WHERE (percent_complete > 75.0)

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("title", "description", "percent_complete", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "VsApp"], ["description", "Mobile Application"], ["percent_complete", 10.0], ["created_at", "2024-09-06 02:19:22.869841"], ["updated_at", "2024-09-06 02:19:22.869841"]]

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "percent_complete" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["percent_complete", 20.0], ["updated_at", "2024-09-07 02:08:01.918202"], ["id", 3]]

  def destroy
    @project.destroy!
---
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 2]]