app/models/task.rb

  def update_percent_complete
    project = Project.find(self.project_id)
    count_of_completed_task = project.tasks.completed_tasks.count
    count_of_total_tasks = project.tasks.count
    project.update!(percent_complete: Counter.calculate_percent_complete(count_of_completed_task, count_of_total_tasks))
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."completed" = ?  [["project_id", 15], ["completed", 1]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 15]]
UPDATE "projects" SET "percent_complete" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["percent_complete", 100.0], ["updated_at", "2024-09-16 05:12:02.531197"], ["id", 3]]